{
  "name": "Raja Mahesh Aravapalli",
  "tagline": "Architecting Intelligent Systems @ Microsoft",
  "subtitle": "AI, Data & Cloud at Scale!",
  "profilePictureUrl": "/images/profile.jpg",
  "about": {
    "title": "About Me",
    "bio": [
      "At Microsoft, I architect and engineer intelligent systems that solve complex real-world problems at scale. I design and deploy AI-powered solutions that leverage distributed computing to process massive data volumes, maximize business impact, and pioneer the boundaries of what's technically possible.",
      "My technical expertise encompasses distributed systems architecture, machine learning infrastructure optimization, data engineering pipelines, microservices design, cloud-native architecture, and DevOps practices. I'm passionate about transforming intricate AI/ML and data challenges into elegant, performant, and scalable solutions while mentoring engineering teams to deliver world-class technical excellence.",
      "I champion systems that are intelligent, resilient, and maintainable through rigorous engineering practices. Advocate for architectural excellence, collaborative technical problem-solving, and continuous innovation. Committed to driving impactful technical decisions and fostering a culture of knowledge-sharing that shapes the next generation of engineers."
    ]
  },
  "contacts": {
    "title": "Get in Touch",
    "items": [
      {
        "id": "email",
        "label": "Email",
        "link": "mailto:RajaMahesh.Aravapalli@outlook.com"
      },
      {
        "id": "linkedin",
        "label": "LinkedIn",
        "link": "https://www.linkedin.com/in/raja-mahesh-aravapalli/"
      },
      {
        "id": "twitter",
        "label": "X",
        "link": "https://x.com/RajaMahesh_A"
      },
      {
        "id": "instagram",
        "label": "Instagram",
        "link": "https://instagram.com/mighty.9999"
      },
      {
        "id": "github",
        "label": "GitHub",
        "link": "https://github.com/mighty-raj"
      }
    ]
  },
  "payMe": {
    "title": "Payment Info",
    "description": "Available for consulting and collaboration opportunities.",
    "qrCodeUrl": "https://via.placeholder.com/200"
  },
  "footer": {
    "copyrightName": "Raja Mahesh Aravapalli"
  }
}
